app/views/mechanics/show.html.erb

SELECT "games".* FROM "games" INNER JOIN "game_mechanics" ON "games"."id" = "game_mechanics"."game_id" WHERE "game_mechanics"."mechanic_id" = ?  [["mechanic_id", 2]]
---
<ul>
	<% @mechanic.games.each do |game| %>