app/views/games/index.html.erb

SELECT "games".* FROM "games" WHERE (name like '%Bamd')  ORDER BY created_at DESC
SELECT "ratings".* FROM "ratings" WHERE "ratings"."game_id" = ?  [["game_id", 1]]
---
      </tr>
      <% Game.order_by_user_friend_rating.each do |game| %>

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."game_id" = ? AND "purchases"."owner_id" = ? LIMIT 1  [["game_id", 1], ["owner_id", 2]]
---
          <% if current_user && game.owners.include?(current_user) %>
            <td class="owner-star"><%= link_to "&#9733".html_safe, game_purchase_path(game, game.purchases.find_by(owner_id: current_user.id)), method: :delete %></td>