app/views/games/show.erb

SELECT "mechanics".* FROM "mechanics" INNER JOIN "game_mechanics" ON "mechanics"."id" = "game_mechanics"."mechanic_id" WHERE "game_mechanics"."game_id" = ?  [["game_id", 1]]
---
    <h2>Mechanics:</h2>
      <% @game.mechanics.each do |mechanic| %>

SELECT "ratings".* FROM "ratings" WHERE "ratings"."game_id" = ?  [["game_id", 1]]
---
    <h2>REVIEWS!</h2>
    <% @game.ratings.each do |rating| %>