app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("to_id", "from_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["to_id", 3], ["from_id", 2], ["created_at", "2015-09-15 14:52:21.049348"], ["updated_at", "2015-09-15 14:52:21.049348"]]
---
  def create
    @friendship = current_user.friendships.build(:to_id => params[:to_id])
    if @friendship.save

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "friendships" SET "confirmed" = ?, "updated_at" = ? WHERE "friendships"."id" = ?  [["confirmed", "t"], ["updated_at", "2015-09-15 15:27:52.102733"], ["id", 1]]
INSERT INTO "friendships" ("from_id", "to_id", "confirmed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["from_id", 3], ["to_id", 2], ["confirmed", "t"], ["created_at", "2015-09-15 15:27:52.107157"], ["updated_at", "2015-09-15 15:27:52.107157"]]
---
  def update
    @friendship = Friendship.find(params[:id])
    @friendship.update_attribute(:confirmed, true)

    Friendship.create(from_id: @friendship.to_id, to_id: @friendship.from_id, confirmed: true)