app/controllers/games_controller.rb

  def index
    if params[:search]
      @games = Game.search(params[:search]).order("created_at DESC").page(params[:page]).per(10)
    else
      # @games = Game.order("created_at DESC").page(params[:page]).per(10)
      @games = Kaminari.paginate_array(Game.order_by_user_friend_rating).page(params[:page]).per(10)
---
SELECT "games".* FROM "games" WHERE (name like '%Bamd')  ORDER BY created_at DESC
SELECT "games".* FROM "games"
SELECT "ratings".* FROM "ratings" WHERE "ratings"."game_id" = ?  [["game_id", 1]]

  def show
    @rating = Rating.new
    @game = Game.find_by_id(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]