app/controllers/mechanics_controller.rb

  def index
    @mechanics = Mechanic.all
---
SELECT "mechanics".* FROM "mechanics" WHERE (description like '%Deck')  ORDER BY created_at DESC

  def show
    @mechanic = Mechanic.find_by_id(params[:id])
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT 1  [["id", 2]]