app/controllers/ratings_controller.rb

  def create
    @game = Game.find(params[:game_id])
    @rating = Rating.new(rating_params)
    @game.ratings << @rating
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "ratings" ("stars", "comment", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["stars", 1], ["comment", "I didn't make it to second breakfast :("], ["game_id", 11], ["created_at", "2015-09-15 15:44:32.752874"], ["updated_at", "2015-09-15 15:44:32.752874"]]