app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user && @user.save

SELECT "users".* FROM "users" WHERE (username like '%alex%')  ORDER BY created_at DESC
---
  def index
    if params[:search]
      @users = User.search(params[:search]).order("created_at DESC")